/*
 * 模块ID+功能ID+两位的返回码值（ 如:010101 表示登录成功）
 * 基础运行平台模块ID 01
 * 监察系统模块ID 02
 * 功能ID按界面接口文档从01顺序编号
 * 操作成功，统一最后两位为：00
 * 统一一个常用的返回码:
 * 操作成功     xxxx00
 * 会话超时     xx9900
 * 增加系统异常：XX9999
 * 在实际定义返回码的时候，xx是需要按 "模块ID(两位)+功能ID(两位)+返回码(两位)" 的规则被替换
 */
window.resultCode = {

	'code_01000001' : "获取数据失败",

	'code_01000002' : "未知错误",

	'code_01000003' : "存储数据失败",

	"code_01000004" : "创建任务失败",

	'code_01000005' : '创建任务成功',

	'code_01000006' : '文件上传错误提示',

	'code_01000007' : '上传成功',

	'code_01000008' : '上传文件为空',

	'code_01000009' : '保存文件出现异常',

	'code_01000010' : '文件路径不正确',

	'code_01000011' : '上传文件类型不正确',

	'code_01000012' : '文件大小超出限制',

	'code_01000013' : '返回上传文件信息成功',

	'code_01000014' : '获取权力事项失败',

	'code_01000015' : '存储数据成功',

	'code_01009900' : '登录超时',
	
	'code_01010000' : '登录成功',
	
	'code_01010001' : '密码错误',
	
	'code_01010002' : '用户鉴权失败, 不允许登录',
	
	'code_01010003' : '用户名或密码错误',
	
	'code_01010004' : '用户登录名为空',
	
	'code_01010005' : ' 用户密码为空',
	
	'code_01010006' : '验证码输入错误',
	
	'code_01020000' : '退出成功',
	
	'code_01010000' : '密码修改成功',
	
	'code_01030001' : '原密码错误',
	
	'code_01030002' : '确认密码不匹配',
	
	'code_01030003' : ' 修改密码失败',
	
	'code_01030004' : '用户密码为空',
	
	'code_010601' : '获取表单的模板信息错误'
	
}
